{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Простые операции\n",
    "\n",
    "1) Записываем строку в переменную s\n",
    "\n",
    "\t\ts = '1' * 100\n",
    "\t\t#если строка должна состоять из ста цифр 1\n",
    "\n",
    "2) Переписываем алгоритм с задачи, пока - while, что-то нашлось - 'что-то' in s, что-то не нашлось - 'что-то' not in s: заменить (что-то-одно, что-то-другое) - s = s.replace('что-то-одно', 'что-то-другое', 1), ЕСЛИ и ИНАЧЕ просто пропускаем, пишем только то, что внутри них. КОНЕЦ и все что с ним связанно также пропускаем\n",
    "\n",
    "\t\tПОКА нашлось (11) или нашлось (22)\n",
    "\t\tЕСЛИ нашлось (11)\n",
    "\t\tТО заменить (11, 2)\n",
    "\t\tИНАЧЕ заменить (22, 3)\n",
    "\n",
    "\t\twhile '11' in s or '22' in s:\n",
    "\t\t\ts = s.replace('11', '2', 1)\n",
    "\t\t\ts = s.replace('22', '3', 1)\n",
    "\n",
    "3) Выводим print(s) в конце, вне цикла\n",
    "\n",
    "\t\ts = ...\n",
    "\t\twhile ...\n",
    "\t\t\t...\n",
    "\t\tprint(s)\n",
    "\n",
    "---\n",
    "\n",
    "№1 Какая строка получится в результате применения приведённой ниже программы к строке, состоящей из 108 идущих подряд цифр 7? В ответе запишите полученную строку.\n",
    "\n",
    "НАЧАЛО\n",
    "\n",
    "ПОКА нашлось (33333) ИЛИ нашлось (777)\n",
    "\n",
    "ЕСЛИ нашлось (33333)\n",
    "\n",
    "ТО заменить (33333, 7)\n",
    "\n",
    "ИНАЧЕ заменить (777, 3)\n",
    "\n",
    "КОНЕЦ ЕСЛИ\n",
    "\n",
    "КОНЕЦ ПОКА\n",
    "\n",
    "КОНЕЦ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3337\n"
     ]
    }
   ],
   "source": [
    "s = '7' * 108\n",
    "while '33333' in s or '777' in s:\n",
    "\ts = s.replace('33333', '7', 1)\n",
    "\ts = s.replace('777', '3', 1)\n",
    "print(s)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "№2 Ниже приведена программа для исполнителя Редактор.\n",
    "\n",
    "НАЧАЛО\n",
    "\n",
    "ПОКА нашлось (722) ИЛИ нашлось (557)\n",
    "\n",
    "  ЕСЛИ нашлось (722)\n",
    "\n",
    "    ТО заменить (722, 57)\n",
    "\n",
    "    ИНАЧЕ заменить (557, 72)\n",
    "\n",
    "  КОНЕЦ ЕСЛИ\n",
    "\n",
    "КОНЕЦ ПОКА\n",
    "\n",
    "КОНЕЦ\n",
    " \n",
    "\n",
    "На вход этой программе подается строка, состоящая из 55 цифр; последняя цифра в строке  — цифра 7, а остальные цифры  — пятёрки. Какая строка получится в результате применения программы к этой строке? В ответе запишите полученную строку.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "№3 Какая строка получится в результате применения приведённой ниже программы к строке, состоящей из 77 единиц?\n",
    "\n",
    "НАЧАЛО\n",
    "\n",
    "    ПОКА нашлось (111)\n",
    "\n",
    "        заменить (111, 2)\n",
    "\n",
    "        заменить (222, 3)\n",
    "\n",
    "        заменить (333, 1)\n",
    "\n",
    "    КОНЕЦ ПОКА\n",
    "\n",
    "КОНЕЦ\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Усложненные операции, с неизвестой начальной строкой\n",
    "\n",
    "1) В задачах, где исходная строка неизвестна, нам нужно составить ее самостоятельно, при помощи циклов for (тут уже больше вариаций, покажу несколько из них)\n",
    "\n",
    "\t\tfor i in range(200, 1000):\n",
    "\t\t\ts = '1' * i\n",
    "\t\t\t...\n",
    "\t\t#например строка должна состоять болле чем из двухсот цифр 1\n",
    "\n",
    "\t\tfor i in range(20, 1000):\n",
    "\t\t\tfor j in range(20, 1000):\n",
    "\t\t\t\ts = '0' + '2' * i + '3' * j + '0'\n",
    "\t\t#например строка должна начинаться и заканчиваться нулем, а между нулями должно быть более 20 троек и двоек\n",
    "\n",
    "2) Переписываем алгоритм с задачи, пока - while, что-то нашлось - 'что-то' in s, что-то не нашлось - 'что-то' not in s: заменить (что-то-одно, что-то-другое) - s = s.replace('что-то-одно', 'что-то-другое', 1), ЕСЛИ и ИНАЧЕ просто пропускаем, пишем только то, что внутри них. КОНЕЦ и все что с ним связанно также пропускаем\n",
    "\n",
    "\t\tПОКА нашлось (11) или нашлось (22)\n",
    "\t\tЕСЛИ нашлось (11)\n",
    "\t\tТО заменить (11, 2)\n",
    "\t\tИНАЧЕ заменить (22, 3)\n",
    "\t\tfor ...\n",
    "\t\t\twhile '11' in s or '22' in s:\n",
    "\t\t\t\ts = s.replace('11', '2', 1)\n",
    "\t\t\t\ts = s.replace('22', '3', 1)\n",
    "\t\t\t...\n",
    "\n",
    "3) Делаем необходимую проверку и выводим нужный ответ\n",
    "\n",
    "\t\tif s.count('2') == 0:\n",
    "\t\t\tprint(i)\n",
    "\t\t#например нужно найти минимальное кол-во едениц в исходной строке, при котором после исполнения программы итоговая строка будет содержать только единицы - тут смотрим на все возможные символы внутри replace, допустим в нашем примере мы использовали только '2' и '1', и чтобы проверить, что в строке содержаться только единички, нам достаточно проверить, что в этой строке не содержатся двойки: s.count('2') == 0\n",
    "\n",
    "---\n",
    "\n",
    "№4 Дана программа для редактора:\n",
    "\n",
    "НАЧАЛО\n",
    "\n",
    "    ПОКА нашлось (111) ИЛИ нашлось (222)\n",
    "\n",
    "        заменить (111, 22)\n",
    "\n",
    "        заменить (222, 1)\n",
    "\n",
    "    КОНЕЦ ПОКА\n",
    "\n",
    "КОНЕЦ\n",
    "\n",
    " \n",
    "Известно, что исходная строка содержала больше 200 единиц и не содержала других цифр, а после выполнения программы тоже получилась строка, содержащая только единицы. Какое наименьшее количество единиц могло быть в исходной строке?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "205\n"
     ]
    }
   ],
   "source": [
    "for i in range(200, 1000):\n",
    "\tfor j in range(100, 1000):\n",
    "\t\ts = '3' + i * '1' + j * '2'\n",
    "\t\twhile '111' in s or '222' in s:\n",
    "\t\t\ts = s.replace('111', '22', 1)\n",
    "\t\t\ts = s.replace('222', '1', 1)\n",
    "\t\tif s.count('1') == len(s):\n",
    "\t\t\tprint(i)\n",
    "\t\t\tbreak\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "№5 На вход приведённой ниже программе поступает строка, начинающаяся с символа «>», а затем содержащая 11 цифр 1, 12 цифр 2 и 30 цифр 3, расположенных в произвольном порядке.\n",
    "\n",
    "Определите сумму числовых значений цифр строки, получившейся в результате выполнения программы.\n",
    "\n",
    "\n",
    "НАЧАЛО\n",
    "\n",
    "ПОКА нашлось (>1) ИЛИ нашлось (>2) ИЛИ нашлось (>3)\n",
    "\n",
    "    ЕСЛИ нашлось (>1)\n",
    "\n",
    "        ТО заменить (>1, 22>)\n",
    "\n",
    "    КОНЕЦ ЕСЛИ\n",
    "\n",
    "    ЕСЛИ нашлось (>2)\n",
    "\n",
    "        ТО заменить (>2, 2>)\n",
    "\n",
    "    КОНЕЦ ЕСЛИ\n",
    "\n",
    "    ЕСЛИ нашлось (>3)\n",
    "\n",
    "        ТО заменить (>3, 1>)\n",
    "\n",
    "    КОНЕЦ ЕСЛИ\n",
    "\n",
    "КОНЕЦ ПОКА\n",
    "\n",
    "КОНЕЦ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
